; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite1 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite2 - satellite
	instrument10 - instrument
	instrument11 - instrument
	instrument12 - instrument
	satellite3 - satellite
	instrument13 - instrument
	instrument14 - instrument
	instrument15 - instrument
	satellite4 - satellite
	instrument16 - instrument
	instrument17 - instrument
	instrument18 - instrument
	satellite5 - satellite
	instrument19 - instrument
	instrument20 - instrument
	instrument21 - instrument
	satellite6 - satellite
	instrument22 - instrument
	instrument23 - instrument
	instrument24 - instrument
	instrument25 - instrument
	instrument26 - instrument
	instrument27 - instrument
	instrument28 - instrument
	spectrograph2 - mode
	infrared3 - mode
	thermograph6 - mode
	image4 - mode
	spectrograph1 - mode
	thermograph5 - mode
	image0 - mode
	groundstation0 - direction
	groundstation10 - direction
	groundstation14 - direction
	star16 - direction
	groundstation4 - direction
	groundstation5 - direction
	star12 - direction
	star11 - direction
	groundstation6 - direction
	groundstation13 - direction
	star2 - direction
	groundstation7 - direction
	star17 - direction
	groundstation1 - direction
	star15 - direction
	star8 - direction
	star9 - direction
	star18 - direction
	groundstation3 - direction
	phenomenon19 - direction
	star20 - direction
	phenomenon21 - direction
	planet22 - direction
	phenomenon23 - direction
	phenomenon24 - direction
	star25 - direction
	star26 - direction
	planet27 - direction
	planet28 - direction
	phenomenon29 - direction
	phenomenon30 - direction
	planet31 - direction
	star32 - direction
	planet33 - direction
	phenomenon34 - direction
	planet35 - direction
	planet36 - direction
	phenomenon37 - direction
	planet38 - direction
	planet39 - direction
	star40 - direction
	planet41 - direction
	star42 - direction
	phenomenon43 - direction
	planet44 - direction
	star45 - direction
	star46 - direction
	phenomenon47 - direction
)
(:init
	(supports instrument0 thermograph6)
	(calibration_target instrument0 star15)
	(supports instrument1 infrared3)
	(supports instrument1 image4)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 star8)
	(supports instrument2 infrared3)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 groundstation13)
	(calibration_target instrument2 star15)
	(calibration_target instrument2 groundstation5)
	(calibration_target instrument2 groundstation0)
	(supports instrument3 thermograph6)
	(supports instrument3 spectrograph2)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 star16)
	(calibration_target instrument3 star2)
	(calibration_target instrument3 groundstation4)
	(calibration_target instrument3 star8)
	(calibration_target instrument3 groundstation3)
	(calibration_target instrument3 groundstation13)
	(supports instrument4 thermograph5)
	(calibration_target instrument4 groundstation1)
	(calibration_target instrument4 groundstation13)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(on_board instrument3 satellite0)
	(on_board instrument4 satellite0)
	(power_avail satellite0)
	(pointing satellite0 phenomenon34)
	(supports instrument5 infrared3)
	(calibration_target instrument5 star18)
	(calibration_target instrument5 star9)
	(calibration_target instrument5 groundstation1)
	(supports instrument6 image4)
	(supports instrument6 infrared3)
	(calibration_target instrument6 star9)
	(calibration_target instrument6 groundstation3)
	(calibration_target instrument6 groundstation13)
	(calibration_target instrument6 star8)
	(calibration_target instrument6 star15)
	(supports instrument7 spectrograph1)
	(supports instrument7 image0)
	(calibration_target instrument7 groundstation0)
	(supports instrument8 spectrograph2)
	(supports instrument8 thermograph5)
	(supports instrument8 thermograph6)
	(calibration_target instrument8 star15)
	(calibration_target instrument8 groundstation14)
	(calibration_target instrument8 groundstation5)
	(supports instrument9 spectrograph2)
	(supports instrument9 infrared3)
	(supports instrument9 spectrograph1)
	(calibration_target instrument9 groundstation13)
	(calibration_target instrument9 groundstation4)
	(calibration_target instrument9 groundstation1)
	(calibration_target instrument9 star12)
	(calibration_target instrument9 star11)
	(on_board instrument5 satellite1)
	(on_board instrument6 satellite1)
	(on_board instrument7 satellite1)
	(on_board instrument8 satellite1)
	(on_board instrument9 satellite1)
	(power_avail satellite1)
	(pointing satellite1 phenomenon24)
	(supports instrument10 thermograph5)
	(supports instrument10 infrared3)
	(supports instrument10 spectrograph1)
	(calibration_target instrument10 star2)
	(calibration_target instrument10 groundstation4)
	(calibration_target instrument10 star8)
	(calibration_target instrument10 star16)
	(calibration_target instrument10 star11)
	(supports instrument11 spectrograph2)
	(supports instrument11 image0)
	(calibration_target instrument11 star2)
	(calibration_target instrument11 star18)
	(calibration_target instrument11 star12)
	(calibration_target instrument11 groundstation3)
	(calibration_target instrument11 groundstation1)
	(calibration_target instrument11 star15)
	(supports instrument12 spectrograph2)
	(calibration_target instrument12 star18)
	(calibration_target instrument12 star8)
	(on_board instrument10 satellite2)
	(on_board instrument11 satellite2)
	(on_board instrument12 satellite2)
	(power_avail satellite2)
	(pointing satellite2 phenomenon29)
	(supports instrument13 thermograph5)
	(calibration_target instrument13 groundstation14)
	(calibration_target instrument13 star11)
	(calibration_target instrument13 star2)
	(calibration_target instrument13 groundstation1)
	(calibration_target instrument13 groundstation7)
	(calibration_target instrument13 star17)
	(supports instrument14 image4)
	(supports instrument14 infrared3)
	(supports instrument14 spectrograph2)
	(calibration_target instrument14 groundstation4)
	(calibration_target instrument14 groundstation3)
	(supports instrument15 thermograph5)
	(supports instrument15 image4)
	(calibration_target instrument15 star17)
	(calibration_target instrument15 groundstation14)
	(calibration_target instrument15 groundstation10)
	(calibration_target instrument15 groundstation1)
	(calibration_target instrument15 star15)
	(on_board instrument13 satellite3)
	(on_board instrument14 satellite3)
	(on_board instrument15 satellite3)
	(power_avail satellite3)
	(pointing satellite3 groundstation3)
	(supports instrument16 spectrograph2)
	(calibration_target instrument16 groundstation7)
	(calibration_target instrument16 star16)
	(calibration_target instrument16 groundstation1)
	(supports instrument17 spectrograph1)
	(calibration_target instrument17 groundstation6)
	(supports instrument18 spectrograph1)
	(supports instrument18 thermograph6)
	(calibration_target instrument18 star18)
	(calibration_target instrument18 groundstation5)
	(calibration_target instrument18 groundstation4)
	(on_board instrument16 satellite4)
	(on_board instrument17 satellite4)
	(on_board instrument18 satellite4)
	(power_avail satellite4)
	(pointing satellite4 groundstation6)
	(supports instrument19 spectrograph2)
	(supports instrument19 spectrograph1)
	(supports instrument19 image4)
	(calibration_target instrument19 groundstation1)
	(calibration_target instrument19 star2)
	(calibration_target instrument19 groundstation7)
	(calibration_target instrument19 star12)
	(calibration_target instrument19 star15)
	(calibration_target instrument19 star18)
	(supports instrument20 image4)
	(calibration_target instrument20 groundstation5)
	(calibration_target instrument20 star2)
	(supports instrument21 infrared3)
	(calibration_target instrument21 star11)
	(calibration_target instrument21 groundstation13)
	(calibration_target instrument21 star18)
	(calibration_target instrument21 star12)
	(on_board instrument19 satellite5)
	(on_board instrument20 satellite5)
	(on_board instrument21 satellite5)
	(power_avail satellite5)
	(pointing satellite5 star9)
	(supports instrument22 spectrograph2)
	(supports instrument22 infrared3)
	(calibration_target instrument22 star11)
	(calibration_target instrument22 star9)
	(calibration_target instrument22 groundstation7)
	(supports instrument23 spectrograph1)
	(supports instrument23 thermograph5)
	(calibration_target instrument23 star18)
	(calibration_target instrument23 groundstation13)
	(calibration_target instrument23 star8)
	(calibration_target instrument23 star9)
	(calibration_target instrument23 groundstation6)
	(supports instrument24 spectrograph2)
	(supports instrument24 thermograph6)
	(supports instrument24 spectrograph1)
	(calibration_target instrument24 star2)
	(supports instrument25 image0)
	(supports instrument25 spectrograph1)
	(supports instrument25 infrared3)
	(calibration_target instrument25 groundstation7)
	(supports instrument26 image0)
	(supports instrument26 image4)
	(supports instrument26 thermograph6)
	(calibration_target instrument26 groundstation1)
	(calibration_target instrument26 groundstation3)
	(calibration_target instrument26 star17)
	(supports instrument27 image0)
	(supports instrument27 thermograph5)
	(supports instrument27 spectrograph1)
	(calibration_target instrument27 star8)
	(calibration_target instrument27 star15)
	(supports instrument28 image0)
	(calibration_target instrument28 groundstation3)
	(calibration_target instrument28 star18)
	(calibration_target instrument28 star9)
	(on_board instrument22 satellite6)
	(on_board instrument23 satellite6)
	(on_board instrument24 satellite6)
	(on_board instrument25 satellite6)
	(on_board instrument26 satellite6)
	(on_board instrument27 satellite6)
	(on_board instrument28 satellite6)
	(power_avail satellite6)
	(pointing satellite6 groundstation14)
)
(:goal (and
	(pointing satellite0 groundstation10)
	(pointing satellite1 star25)
	(pointing satellite3 planet27)
	(have_image phenomenon19 spectrograph1)
	(have_image phenomenon19 image0)
	(have_image star20 spectrograph2)
	(have_image phenomenon21 spectrograph2)
	(have_image planet22 thermograph6)
	(have_image planet22 spectrograph1)
	(have_image phenomenon23 spectrograph2)
	(have_image phenomenon23 thermograph5)
	(have_image phenomenon24 thermograph5)
	(have_image star25 image0)
	(have_image star26 infrared3)
	(have_image planet27 image4)
	(have_image planet27 infrared3)
	(have_image planet28 image0)
	(have_image phenomenon29 thermograph6)
	(have_image phenomenon29 spectrograph2)
	(have_image phenomenon30 spectrograph2)
	(have_image planet31 thermograph5)
	(have_image planet31 image4)
	(have_image star32 spectrograph2)
	(have_image star32 thermograph6)
	(have_image planet33 image0)
	(have_image planet33 thermograph5)
	(have_image phenomenon34 image0)
	(have_image planet35 spectrograph1)
	(have_image planet36 thermograph5)
	(have_image phenomenon37 image0)
	(have_image phenomenon37 spectrograph1)
	(have_image planet38 image0)
	(have_image planet38 thermograph5)
	(have_image planet39 infrared3)
	(have_image star40 spectrograph1)
	(have_image planet41 thermograph6)
	(have_image star42 image4)
	(have_image phenomenon43 image4)
	(have_image planet44 spectrograph2)
	(have_image planet44 infrared3)
	(have_image star46 spectrograph1)
	(have_image star46 infrared3)
	(have_image phenomenon47 image0)
	(have_image phenomenon47 infrared3)
))
(:metric minimize (total-time))

)

; plan
1. (turn_to satellite0 groundstation10 phenomenon34)
   deleted: (pointing satellite0 phenomenon34)
   added: (pointing satellite0 groundstation10)
   goals met: 1 of 44
2. (turn_to satellite1 star25 phenomenon24)
   deleted: (pointing satellite1 phenomenon24)
   added: (pointing satellite1 star25)
   goals met: 2 of 44
3. (switch_on instrument25 satellite6)
   deleted: (power_avail satellite6)
   added: (power_on instrument25)
   goals met: 2 of 44
4. (turn_to satellite6 planet33 groundstation14)
   deleted: (pointing satellite6 groundstation14)
   added: (pointing satellite6 planet33)
   goals met: 2 of 44
5. (switch_on instrument17 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument17)
   goals met: 2 of 44
6. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 44
7. (switch_on instrument14 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument14)
   goals met: 2 of 44
8. (switch_on instrument7 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument7)
   goals met: 2 of 44
9. (switch_on instrument10 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument10)
   goals met: 2 of 44
10. (turn_to satellite2 phenomenon23 phenomenon29)
   deleted: (pointing satellite2 phenomenon29)
   added: (pointing satellite2 phenomenon23)
   goals met: 2 of 44
11. (calibrate satellite4 instrument17 groundstation6)
   added: (calibrated instrument17)
   goals met: 2 of 44
12. (turn_to satellite4 phenomenon19 groundstation6)
   deleted: (pointing satellite4 groundstation6)
   added: (pointing satellite4 phenomenon19)
   goals met: 2 of 44
13. (calibrate satellite3 instrument14 groundstation3)
   added: (calibrated instrument14)
   goals met: 2 of 44
14. (turn_to satellite3 planet27 groundstation3)
   deleted: (pointing satellite3 groundstation3)
   added: (pointing satellite3 planet27)
   goals met: 3 of 44
15. (turn_to satellite6 groundstation7 planet33)
   deleted: (pointing satellite6 planet33)
   added: (pointing satellite6 groundstation7)
   goals met: 3 of 44
16. (turn_to satellite0 star15 groundstation10)
   deleted: (pointing satellite0 groundstation10)
   added: (pointing satellite0 star15)
   goals met: 2 of 44
17. (turn_to satellite2 star2 phenomenon23)
   deleted: (pointing satellite2 phenomenon23)
   added: (pointing satellite2 star2)
   goals met: 2 of 44
18. (take_image satellite4 phenomenon19 instrument17 spectrograph1)
   added: (have_image phenomenon19 spectrograph1)
   goals met: 3 of 44
19. (calibrate satellite6 instrument25 groundstation7)
   added: (calibrated instrument25)
   goals met: 3 of 44
20. (turn_to satellite6 phenomenon19 groundstation7)
   deleted: (pointing satellite6 groundstation7)
   added: (pointing satellite6 phenomenon19)
   goals met: 3 of 44
21. (calibrate satellite0 instrument0 star15)
   added: (calibrated instrument0)
   goals met: 3 of 44
22. (turn_to satellite0 groundstation10 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 groundstation10)
   goals met: 4 of 44
23. (calibrate satellite2 instrument10 star2)
   added: (calibrated instrument10)
   goals met: 4 of 44
24. (turn_to satellite2 phenomenon23 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 phenomenon23)
   goals met: 4 of 44
25. (take_image satellite3 planet27 instrument14 image4)
   added: (have_image planet27 image4)
   goals met: 5 of 44
26. (take_image satellite3 planet27 instrument14 infrared3)
   added: (have_image planet27 infrared3)
   goals met: 6 of 44
27. (turn_to satellite4 phenomenon37 phenomenon19)
   deleted: (pointing satellite4 phenomenon19)
   added: (pointing satellite4 phenomenon37)
   goals met: 6 of 44
28. (take_image satellite6 phenomenon19 instrument25 image0)
   added: (have_image phenomenon19 image0)
   goals met: 7 of 44
29. (take_image satellite2 phenomenon23 instrument10 thermograph5)
   added: (have_image phenomenon23 thermograph5)
   goals met: 8 of 44
30. (turn_to satellite0 phenomenon29 groundstation10)
   deleted: (pointing satellite0 groundstation10)
   added: (pointing satellite0 phenomenon29)
   goals met: 7 of 44
31. (turn_to satellite3 planet44 planet27)
   deleted: (pointing satellite3 planet27)
   added: (pointing satellite3 planet44)
   goals met: 6 of 44
32. (take_image satellite4 phenomenon37 instrument17 spectrograph1)
   added: (have_image phenomenon37 spectrograph1)
   goals met: 7 of 44
33. (turn_to satellite0 groundstation10 phenomenon29)
   deleted: (pointing satellite0 phenomenon29)
   added: (pointing satellite0 groundstation10)
   goals met: 8 of 44
34. (turn_to satellite6 phenomenon34 phenomenon19)
   deleted: (pointing satellite6 phenomenon19)
   added: (pointing satellite6 phenomenon34)
   goals met: 8 of 44
35. (turn_to satellite2 phenomenon24 phenomenon23)
   deleted: (pointing satellite2 phenomenon23)
   added: (pointing satellite2 phenomenon24)
   goals met: 8 of 44
36. (take_image satellite3 planet44 instrument14 infrared3)
   added: (have_image planet44 infrared3)
   goals met: 9 of 44
37. (take_image satellite3 planet44 instrument14 spectrograph2)
   added: (have_image planet44 spectrograph2)
   goals met: 10 of 44
38. (turn_to satellite4 planet22 phenomenon37)
   deleted: (pointing satellite4 phenomenon37)
   added: (pointing satellite4 planet22)
   goals met: 10 of 44
39. (turn_to satellite6 phenomenon47 phenomenon34)
   deleted: (pointing satellite6 phenomenon34)
   added: (pointing satellite6 phenomenon47)
   goals met: 10 of 44
40. (take_image satellite2 phenomenon24 instrument10 thermograph5)
   added: (have_image phenomenon24 thermograph5)
   goals met: 11 of 44
41. (turn_to satellite0 phenomenon29 groundstation10)
   deleted: (pointing satellite0 groundstation10)
   added: (pointing satellite0 phenomenon29)
   goals met: 10 of 44
42. (turn_to satellite3 planet27 planet44)
   deleted: (pointing satellite3 planet44)
   added: (pointing satellite3 planet27)
   goals met: 11 of 44
43. (take_image satellite4 planet22 instrument17 spectrograph1)
   added: (have_image planet22 spectrograph1)
   goals met: 12 of 44
44. (take_image satellite6 phenomenon47 instrument25 image0)
   added: (have_image phenomenon47 image0)
   goals met: 13 of 44
45. (take_image satellite6 phenomenon47 instrument25 infrared3)
   added: (have_image phenomenon47 infrared3)
   goals met: 14 of 44
46. (turn_to satellite0 groundstation10 phenomenon29)
   deleted: (pointing satellite0 phenomenon29)
   added: (pointing satellite0 groundstation10)
   goals met: 15 of 44
47. (turn_to satellite2 star26 phenomenon24)
   deleted: (pointing satellite2 phenomenon24)
   added: (pointing satellite2 star26)
   goals met: 15 of 44
48. (turn_to satellite6 star25 phenomenon47)
   deleted: (pointing satellite6 phenomenon47)
   added: (pointing satellite6 star25)
   goals met: 15 of 44
49. (turn_to satellite3 phenomenon30 planet27)
   deleted: (pointing satellite3 planet27)
   added: (pointing satellite3 phenomenon30)
   goals met: 14 of 44
50. (turn_to satellite4 star46 planet22)
   deleted: (pointing satellite4 planet22)
   added: (pointing satellite4 star46)
   goals met: 14 of 44
51. (turn_to satellite0 star32 groundstation10)
   deleted: (pointing satellite0 groundstation10)
   added: (pointing satellite0 star32)
   goals met: 13 of 44
52. (take_image satellite2 star26 instrument10 infrared3)
   added: (have_image star26 infrared3)
   goals met: 14 of 44
53. (take_image satellite4 star46 instrument17 spectrograph1)
   added: (have_image star46 spectrograph1)
   goals met: 15 of 44
54. (turn_to satellite0 groundstation10 star32)
   deleted: (pointing satellite0 star32)
   added: (pointing satellite0 groundstation10)
   goals met: 16 of 44
55. (turn_to satellite3 planet27 phenomenon30)
   deleted: (pointing satellite3 phenomenon30)
   added: (pointing satellite3 planet27)
   goals met: 17 of 44
56. (turn_to satellite6 phenomenon34 star25)
   deleted: (pointing satellite6 star25)
   added: (pointing satellite6 phenomenon34)
   goals met: 17 of 44
57. (turn_to satellite2 planet31 star26)
   deleted: (pointing satellite2 star26)
   added: (pointing satellite2 planet31)
   goals met: 17 of 44
58. (take_image satellite6 phenomenon34 instrument25 image0)
   added: (have_image phenomenon34 image0)
   goals met: 18 of 44
59. (turn_to satellite3 phenomenon21 planet27)
   deleted: (pointing satellite3 planet27)
   added: (pointing satellite3 phenomenon21)
   goals met: 17 of 44
60. (turn_to satellite0 phenomenon29 groundstation10)
   deleted: (pointing satellite0 groundstation10)
   added: (pointing satellite0 phenomenon29)
   goals met: 16 of 44
61. (turn_to satellite4 star40 star46)
   deleted: (pointing satellite4 star46)
   added: (pointing satellite4 star40)
   goals met: 16 of 44
62. (take_image satellite2 planet31 instrument10 thermograph5)
   added: (have_image planet31 thermograph5)
   goals met: 17 of 44
63. (take_image satellite3 phenomenon21 instrument14 spectrograph2)
   added: (have_image phenomenon21 spectrograph2)
   goals met: 18 of 44
64. (turn_to satellite0 groundstation10 phenomenon29)
   deleted: (pointing satellite0 phenomenon29)
   added: (pointing satellite0 groundstation10)
   goals met: 19 of 44
65. (take_image satellite4 star40 instrument17 spectrograph1)
   added: (have_image star40 spectrograph1)
   goals met: 20 of 44
66. (turn_to satellite6 phenomenon37 phenomenon34)
   deleted: (pointing satellite6 phenomenon34)
   added: (pointing satellite6 phenomenon37)
   goals met: 20 of 44
67. (turn_to satellite2 planet33 planet31)
   deleted: (pointing satellite2 planet31)
   added: (pointing satellite2 planet33)
   goals met: 20 of 44
68. (turn_to satellite3 planet27 phenomenon21)
   deleted: (pointing satellite3 phenomenon21)
   added: (pointing satellite3 planet27)
   goals met: 21 of 44
69. (take_image satellite6 phenomenon37 instrument25 image0)
   added: (have_image phenomenon37 image0)
   goals met: 22 of 44
70. (turn_to satellite0 phenomenon29 groundstation10)
   deleted: (pointing satellite0 groundstation10)
   added: (pointing satellite0 phenomenon29)
   goals met: 21 of 44
71. (take_image satellite2 planet33 instrument10 thermograph5)
   added: (have_image planet33 thermograph5)
   goals met: 22 of 44
72. (take_image satellite0 phenomenon29 instrument0 thermograph6)
   added: (have_image phenomenon29 thermograph6)
   goals met: 23 of 44
73. (turn_to satellite3 phenomenon23 planet27)
   deleted: (pointing satellite3 planet27)
   added: (pointing satellite3 phenomenon23)
   goals met: 22 of 44
74. (turn_to satellite6 planet28 phenomenon37)
   deleted: (pointing satellite6 phenomenon37)
   added: (pointing satellite6 planet28)
   goals met: 22 of 44
75. (turn_to satellite4 planet35 star40)
   deleted: (pointing satellite4 star40)
   added: (pointing satellite4 planet35)
   goals met: 22 of 44
76. (turn_to satellite2 planet36 planet33)
   deleted: (pointing satellite2 planet33)
   added: (pointing satellite2 planet36)
   goals met: 22 of 44
77. (take_image satellite3 phenomenon23 instrument14 spectrograph2)
   added: (have_image phenomenon23 spectrograph2)
   goals met: 23 of 44
78. (turn_to satellite0 groundstation10 phenomenon29)
   deleted: (pointing satellite0 phenomenon29)
   added: (pointing satellite0 groundstation10)
   goals met: 24 of 44
79. (take_image satellite6 planet28 instrument25 image0)
   added: (have_image planet28 image0)
   goals met: 25 of 44
80. (take_image satellite4 planet35 instrument17 spectrograph1)
   added: (have_image planet35 spectrograph1)
   goals met: 26 of 44
81. (take_image satellite2 planet36 instrument10 thermograph5)
   added: (have_image planet36 thermograph5)
   goals met: 27 of 44
82. (turn_to satellite3 planet27 phenomenon23)
   deleted: (pointing satellite3 phenomenon23)
   added: (pointing satellite3 planet27)
   goals met: 28 of 44
83. (turn_to satellite0 planet22 groundstation10)
   deleted: (pointing satellite0 groundstation10)
   added: (pointing satellite0 planet22)
   goals met: 27 of 44
84. (turn_to satellite6 planet33 planet28)
   deleted: (pointing satellite6 planet28)
   added: (pointing satellite6 planet33)
   goals met: 27 of 44
85. (turn_to satellite2 planet38 planet36)
   deleted: (pointing satellite2 planet36)
   added: (pointing satellite2 planet38)
   goals met: 27 of 44
86. (take_image satellite0 planet22 instrument0 thermograph6)
   added: (have_image planet22 thermograph6)
   goals met: 28 of 44
87. (turn_to satellite3 phenomenon29 planet27)
   deleted: (pointing satellite3 planet27)
   added: (pointing satellite3 phenomenon29)
   goals met: 27 of 44
88. (take_image satellite6 planet33 instrument25 image0)
   added: (have_image planet33 image0)
   goals met: 28 of 44
89. (take_image satellite2 planet38 instrument10 thermograph5)
   added: (have_image planet38 thermograph5)
   goals met: 29 of 44
90. (turn_to satellite3 planet27 phenomenon29)
   deleted: (pointing satellite3 phenomenon29)
   added: (pointing satellite3 planet27)
   goals met: 30 of 44
91. (turn_to satellite0 groundstation10 planet22)
   deleted: (pointing satellite0 planet22)
   added: (pointing satellite0 groundstation10)
   goals met: 31 of 44
92. (turn_to satellite6 planet38 planet33)
   deleted: (pointing satellite6 planet33)
   added: (pointing satellite6 planet38)
   goals met: 31 of 44
93. (turn_to satellite2 planet39 planet38)
   deleted: (pointing satellite2 planet38)
   added: (pointing satellite2 planet39)
   goals met: 31 of 44
94. (turn_to satellite3 star32 planet27)
   deleted: (pointing satellite3 planet27)
   added: (pointing satellite3 star32)
   goals met: 30 of 44
95. (take_image satellite6 planet38 instrument25 image0)
   added: (have_image planet38 image0)
   goals met: 31 of 44
96. (turn_to satellite0 planet41 groundstation10)
   deleted: (pointing satellite0 groundstation10)
   added: (pointing satellite0 planet41)
   goals met: 30 of 44
97. (turn_to satellite3 planet27 star32)
   deleted: (pointing satellite3 star32)
   added: (pointing satellite3 planet27)
   goals met: 31 of 44
98. (take_image satellite2 planet39 instrument10 infrared3)
   added: (have_image planet39 infrared3)
   goals met: 32 of 44
99. (take_image satellite0 planet41 instrument0 thermograph6)
   added: (have_image planet41 thermograph6)
   goals met: 33 of 44
100. (turn_to satellite3 phenomenon29 planet27)
   deleted: (pointing satellite3 planet27)
   added: (pointing satellite3 phenomenon29)
   goals met: 32 of 44
101. (turn_to satellite6 star25 planet38)
   deleted: (pointing satellite6 planet38)
   added: (pointing satellite6 star25)
   goals met: 32 of 44
102. (turn_to satellite2 star46 planet39)
   deleted: (pointing satellite2 planet39)
   added: (pointing satellite2 star46)
   goals met: 32 of 44
103. (turn_to satellite0 groundstation10 planet41)
   deleted: (pointing satellite0 planet41)
   added: (pointing satellite0 groundstation10)
   goals met: 33 of 44
104. (take_image satellite3 phenomenon29 instrument14 spectrograph2)
   added: (have_image phenomenon29 spectrograph2)
   goals met: 34 of 44
105. (take_image satellite6 star25 instrument25 image0)
   added: (have_image star25 image0)
   goals met: 35 of 44
106. (take_image satellite2 star46 instrument10 infrared3)
   added: (have_image star46 infrared3)
   goals met: 36 of 44
107. (turn_to satellite3 planet27 phenomenon29)
   deleted: (pointing satellite3 phenomenon29)
   added: (pointing satellite3 planet27)
   goals met: 37 of 44
108. (turn_to satellite0 star32 groundstation10)
   deleted: (pointing satellite0 groundstation10)
   added: (pointing satellite0 star32)
   goals met: 36 of 44
109. (take_image satellite0 star32 instrument0 thermograph6)
   added: (have_image star32 thermograph6)
   goals met: 37 of 44
110. (turn_to satellite3 phenomenon30 planet27)
   deleted: (pointing satellite3 planet27)
   added: (pointing satellite3 phenomenon30)
   goals met: 36 of 44
111. (take_image satellite3 phenomenon30 instrument14 spectrograph2)
   added: (have_image phenomenon30 spectrograph2)
   goals met: 37 of 44
112. (turn_to satellite0 groundstation10 star32)
   deleted: (pointing satellite0 star32)
   added: (pointing satellite0 groundstation10)
   goals met: 38 of 44
113. (turn_to satellite3 star42 phenomenon30)
   deleted: (pointing satellite3 phenomenon30)
   added: (pointing satellite3 star42)
   goals met: 38 of 44
114. (take_image satellite3 star42 instrument14 image4)
   added: (have_image star42 image4)
   goals met: 39 of 44
115. (turn_to satellite3 phenomenon43 star42)
   deleted: (pointing satellite3 star42)
   added: (pointing satellite3 phenomenon43)
   goals met: 39 of 44
116. (take_image satellite3 phenomenon43 instrument14 image4)
   added: (have_image phenomenon43 image4)
   goals met: 40 of 44
117. (turn_to satellite3 star32 phenomenon43)
   deleted: (pointing satellite3 phenomenon43)
   added: (pointing satellite3 star32)
   goals met: 40 of 44
118. (take_image satellite3 star32 instrument14 spectrograph2)
   added: (have_image star32 spectrograph2)
   goals met: 41 of 44
119. (turn_to satellite3 planet31 star32)
   deleted: (pointing satellite3 star32)
   added: (pointing satellite3 planet31)
   goals met: 41 of 44
120. (take_image satellite3 planet31 instrument14 image4)
   added: (have_image planet31 image4)
   goals met: 42 of 44
121. (turn_to satellite3 star20 planet31)
   deleted: (pointing satellite3 planet31)
   added: (pointing satellite3 star20)
   goals met: 42 of 44
122. (take_image satellite3 star20 instrument14 spectrograph2)
   added: (have_image star20 spectrograph2)
   goals met: 43 of 44
123. (turn_to satellite3 planet27 star20)
   deleted: (pointing satellite3 star20)
   added: (pointing satellite3 planet27)
   goals met: 44 of 44
